{
  "title": "Immigration",
  "date": "Thursday March 28th, 2019",
  "thumbnail": "/images/uploads/usa-flag-america.jpg",
  "category": "Design",
  "tags": [
    "Resource"
  ],
  "flags": {
    "resource": {
      "active": false,
      "description": "In the Huge Democratic Field, Is There an Opening for a Candidate Who Wants to REDUCE Illegal Immigration?"
    },
    "popular": false
  },
  "body": "\"Democrats, goaded into an oppositionist rut by the president’s harsh rhetoric and policies, are now at risk of being plausibly portrayed as a party indifferent to porous borders — a stance that is substantively wrong and could invite electoral disaster.”  Editorial, Washington Post, April 11 \n\n\n\nIn a poll of voters in deepest blue Massachusetts, the level of support for reducing Illegal immigration is considerable, even among such pro-Democratic crops as women and African-Americans, not to mention Hispanics.\n\n\n\n51% of African-Americans support a reduction in illegal immigration, as do 57% of women.  The share of Hispanics who support a reduction is 59%. As you can see, however, large majorities in each of these three groups do NOT support a reduction in legal immigration.\n\n\n\nThus, large majorities of the voters in each of these groups regard the distinction between illegal immigration and legal immigration as a significant one.  These majorities support a reduction in the first, but not a reduction in the second.\n\n\n\nIn Massachusetts, a Democratic presidential primary is open not only to registered D’s, but also to registered I’s, who make up a majority of the overall electorate.  In the poll, 75% of the self-identified I's  support a reduction in illegal immigration.  Of the self-identified D’s, 45% support a reduction in it.\n\nWhich one of the following statements on immigration policy is closest to your own view? 9/18 MPG state general ivr N=403 more 5%\n\n||||||\n|---|---|---|---|---|\n||Reduce illegal & legal & legal immigration| Reduce illegal not legal immigration| Reduce neither|Undecided/DK|\n|IDEPENDENTS|17%|58%|19%|7%|\n|MEN|19%|53%|19%|9%|\n|WHITE|14%|55%|24%|8%|\n|ALL VOTERS|16%|48%|25%|12%|\n|HISPANICS|15%|44%|30%|11%|\n|WOMEN|13%|44%|29%|14%|\n|AFRICAN AM|19%|32%|28%|22%|\n|DEMOCRATS|12%|33%|38%|18%|\n\nAsked if the government should do more or less than it now does to secure the border, a plurality of all voters would have it do more. \n\n   “Should the federal government do more than it does now to secure the border, or do less, or continue to do the same?\" 9/18 MPG state general ivr N=403 moe 5%\n"
}