{
  "title": "Marijuana",
  "date": "Wednesday April 24th, 2019",
  "flags": {
    "resource": {
      "active": false,
      "description": "Strong support for legalized marijuana, less for mandatory health care coverage, and mixed reviews on the CCC."
    },
    "popular": false
  },
  "body": "This is an early April number and 40% of respondents think legalization has had a positive impact on the state. That’s the single largest segment of the electorate, 10% higher than negative impact and when combined with those who see no impact that’s 70% to 30% for the roll out to date. Not bad, and likely to get better as reefer madness fails to materialize.\n\nWhat impact do you believe the legalization of marijuana has had statewide? 4/19 Emerson state D primary\n\n```\nPositive impact\t40%\n```\n\n```\nNegative impact\t30%\t70%-30% no impact \n```\n\n```\nNo impact\t\t30% \n```\n\nNo state agency gets good numbers so 43% to 25% positive is probably as good a place as any to benchmark this crew. Let’s see what it looks like in six months, if it’s on the slide look for a call for new commissioners. \n\nHow would you rate the job the Cannabis Control Commission is doing in legalizing retail marijuana stores? 12/18 MPG state general ivr N=444 (IVR) moe 5% \n\n```\nExcellent, they are trying to protect the public \t\t\t\t16% \n```\n\n```\nOk, but slow because they don’t know the industry\t\t\t\t27% 43% approve\n```\n\n```\nBummer, it’s been almost two years and still no retail store \t13% 25% disapprove\t\n```\n\n```\nTerrible, anti weed dopes making it harder than necessary \t\t12% \n```\n\n```\nDon’t know \t\t\t\t\t\t\t\t\t\t\t\t\t\t32%\n```\n\nMedical coverage for medical users is heading in the right direction but needs a few more years before it’s politically ripe.\n\nA law that makes it mandatory for health insurance to cover the cost of medical  \n\nmarijuana? 9/18 MPG state general ivr N=403 moe 5% \n\n```\nVery\t\t\t\t\t28%\n```\n\n```\nSomewhat\t\t\t\t24% 52% yes\n```\n\n```\nNot Very\t\t\t\t12% 41% no\n```\n\n```\nNot at All \t\t\t\t29%\n```\n\n```\nDon’t Know/Not Sure \t7%\n```"
}